const experience = [
  {
    id: 1,
    name: 'Demis Group / Энергопроф',
    title: 'SEO-специалист',
    start: 'Октябрь 2011',
    end: 'Июль 2020',
    text: `Комплексная проработка сайтов различных тематик с целью вывода их в топ поисковой выдачи.`,
  },
  {
    id: 2,
    name: 'Фриланс',
    title: 'HTML-верстальщик',
    start: 'Сентябрь 2021',
    end: 'Июнь 2023',
    text: `Кроссбраузерная адаптивная вёрстка сайтов различной сложности. Натяжка вёрстки и доработка тем для WordPress. Создание одностраничный сайтов с помощью React и Vue.`,
  },
  {
    id: 3,
    name: 'IBS',
    title: 'HTML-верстальщик',
    start: 'Июнь 2023',
    end: 'настоящее время',
    text: `Кроссбраузерная адаптивная вёрстка с использованием шаблонизатора Twig, препроцессора Stylus и библиотеки JQuery.`,
  },
];

export default experience;
